app/controllers/articles_controller.rb

SELECT `articles`.* FROM `articles` ORDER BY `articles`.`released_at` DESC
SELECT  `articles`.* FROM `articles` WHERE (released_at <= '2018-12-01 17:00:14.755810') AND (expired_at > '2018-12-01 17:00:14.755810' OR expired_at IS NULL) ORDER BY `articles`.`released_at` DESC LIMIT 5
---
  def index
    @articles = Article.order(released_at: :desc)

    @articles = @articles.open_to_the_public unless current_user

    unless current_user&.administrator?
      @articles = @articles.visible
    end

    @articles = @articles.page(params[:page]).per(5)

SELECT  `articles`.* FROM `articles` LIMIT 1
SELECT  `articles`.* FROM `articles` WHERE (released_at <= '2018-12-06 21:12:30.595359') AND `articles`.`id` = 5 LIMIT 1
---
  def show
    articles = Article.all

    articles = articles.open_to_the_public unless current_user

    unless current_user&.administrator?
      articles = articles.visible
    end

    @article = articles.find(params[:id])

INSERT INTO `articles` (`title`, `body`, `released_at`, `expired_at`, `user_only`, `created_at`, `updated_at`) VALUES ('admin', 'test', '2018-12-03 16:17:00', '2018-12-03 16:17:00', FALSE, '2018-12-03 16:17:49', '2018-12-03 16:17:49')
---
  def create
    @article = Article.new(params[:article])
    if @article.save

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 5 LIMIT 1
UPDATE `articles` SET `title` = '好きなアニメ作品', `body` = 'やはり俺の青春ラブコメは間違っている \r\n\r\nソードアートオンラインコードギアス　反逆のルルーシュ\r\n\r\n魔法科高校の劣等生　\r\n\r\nとある魔術の禁書目録', `released_at` = '2018-11-20 10:51:00', `expired_at` = '2018-11-26 10:51:00', `updated_at` = '2018-11-26 06:45:18' WHERE `articles`.`id` = 4
---
  def update
    @article = Article.find(params[:id])
    @article.assign_attributes(params[:article])
    if @article.save