app/controllers/passwords_controller.rb

UPDATE `users` SET `password_digest` = '$2a$10$TsctG0d8aQ9K38fx2q8Fy.lJ.bC4nyMp.rD7zsidbtanxn0BmTWBa', `updated_at` = '2018-12-05 07:03:04' WHERE `users`.`id` = 1
---
  def update
    @user = current_user
    current_password = params[:account][:current_password]

    if current_password.present?
      if @user.authenticate(current_password)
        @user.assign_attributes(params[:account])
        if @user.save