app/controllers/users_controller.rb

  def index
    @users = User.order("id")
---
SELECT `users`.* FROM `users` ORDER BY user_id

  def search
    @users = User.search(params[:q])
---
SELECT `users`.* FROM `users` WHERE (name LIKE '%Taro%' OR full_name LIKE '%Taro%') ORDER BY id

  def create
    @user = User.new(params[:user])
    if @user.save!
---
INSERT INTO `users` (`name`, `full_name`, `email`, `birthday`, `sex`, `password_digest`, `created_at`, `updated_at`) VALUES ('sample', 'sample', 'sample@sample.com', '1980-01-01', 1, '$2a$10$xSFPcz0C3cnR6j.h3hCibuZ.TIB6BPWrA2Njj/iWV/cwCAhiST7Wy', '2018-12-05 13:09:08', '2018-12-05 13:09:08')

  def update
    @user = User.find(params[:id])
    @user.assign_attributes(params[:user])
    if @user.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `email` = 'Katsuki@ample.com', `updated_at` = '2018-12-04 21:57:11' WHERE `users`.`id` = 1